Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
e.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip"
          + "timestamp" = "1752665345396921000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.cloudwatch_lookup_reference_update_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_lookup_reference_update_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-lookup-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:events:ap-southeast-3:438465168484:rule/lookup_update_references_trigger"
      + statement_id        = "CloudwatchLookupReferenceUpdateAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.cloudwatch_pharmcat_reference_update_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_pharmcat_reference_update_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-pharmcat-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:events:ap-southeast-3:438465168484:rule/pharmcat_update_references_trigger"
      + statement_id        = "CloudwatchPharmcatReferenceUpdateAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer:2" -> (known after apply)
      ~ code_sha256                 = "GpSTVB7fN6AdftpnR6ZXPe4ZXnuMim6NNtUjwGN83Mw=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T03:44:31.233+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip" -> "builds/d3e6654c4a3347aba5d93ea34d5c2c66398467646efb815845ab657434e7ab9f.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172651 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250619023037267500000001/builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "837148ae438686c35b7f0204e7d6b211" -> (known after apply)
      ~ id                            = "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip" -> (known after apply)
      ~ key                           = "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip" -> "builds/d3e6654c4a3347aba5d93ea34d5c2c66398467646efb815845ab657434e7ab9f.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip" -> "builds/d3e6654c4a3347aba5d93ea34d5c2c66398467646efb815845ab657434e7ab9f.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d3e6654c4a3347aba5d93ea34d5c2c66398467646efb815845ab657434e7ab9f.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d3e6654c4a3347aba5d93ea34d5c2c66398467646efb815845ab657434e7ab9f.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5865102403363385398" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip" -> "builds/d3e6654c4a3347aba5d93ea34d5c2c66398467646efb815845ab657434e7ab9f.zip"
          ~ "timestamp" = "1750304498283623000" -> "1752665348469908000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1" -> (known after apply)
      ~ code_sha256                 = "XgZJeX/iqF7CvPqOgXXEPaW3UMc4kBs7+CjTmamAiKs=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T02:32:21.971+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip" -> "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 7422 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250619023037267500000001/builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "e25bcd1748497ef4735efdea117c9430" -> (known after apply)
      ~ id                            = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip" -> (known after apply)
      ~ key                           = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip" -> "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip" -> "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4110914356190849222" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/13c2758e203ed7f5364ea362eb6ff354e18460cc292eb6ba826b4978914bd5f3.zip" -> "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip"
          ~ "timestamp" = "1750304495423662000" -> "1752665345675268800"
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:c57203e899e43333530864797db03688451de4fbe1cf1579485b1ca7e96c8bda438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:c57203e899e43333530864797db03688451de4fbe1cf1579485b1ca7e96c8bda" -> (known after apply)
        name         = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:43a83a79c2c5c19e5bcf43bd0e773a3ef65107a589cb4a3fff9cc649e8947a79" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "1159a7a67eb11ff2ac1aea8c6de758745d7ec36b" -> "f704376c21ddab72330bbf761d4997538fc4ae57"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:43a83a79c2c5c19e5bcf43bd0e773a3ef65107a589cb4a3fff9cc649e8947a79" -> (known after apply)
        name                 = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:43a83a79c2c5c19e5bcf43bd0e773a3ef65107a589cb4a3fff9cc649e8947a79" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "1159a7a67eb11ff2ac1aea8c6de758745d7ec36b" -> "f704376c21ddab72330bbf761d4997538fc4ae57"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-admin:sbeacon-backend-admin-0"
        name        = "sbeacon-backend-admin-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cognito-idp:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_vthn2gpgm"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:DescribeNotebookInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendRegistrationEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/60b0e3a68a05054a0bf081218c963ea3d1da3fc284b98f1a9b752478fa34e747.zip" -> "builds/e422c5a5a69819721da7b18e5f1499cf9144a6835283c4f489d361a121433f1e.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-06-19T05:41:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (36 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e422c5a5a69819721da7b18e5f1499cf9144a6835283c4f489d361a121433f1e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e422c5a5a69819721da7b18e5f1499cf9144a6835283c4f489d361a121433f1e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5003345369107879639" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/60b0e3a68a05054a0bf081218c963ea3d1da3fc284b98f1a9b752478fa34e747.zip" -> "builds/e422c5a5a69819721da7b18e5f1499cf9144a6835283c4f489d361a121433f1e.zip"
          ~ "timestamp" = "1750304486239006000" -> "1752665334555698000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-saved-queries",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-pricing-cache",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-variants",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-annotations",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = "pricing:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users/index/uid-index",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_vthn2gpgm"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*"
                    },
                  - {
                      - Action   = "sagemaker:ListNotebookInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::438465168484:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*",
                                  - "private/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250619023048449900000002/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/private/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-indexer",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateReports",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateCohortVCfs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f9f60af32b15f107483d73c3d85d366ed15c32a6ec1c9212409a445be726e8f7.zip" -> "builds/96632e73a6502eb3c4b63292eb03602b87bc5eb64fca4c0ff5a9659f3bdce2d7.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-06-19T05:42:02.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/96632e73a6502eb3c4b63292eb03602b87bc5eb64fca4c0ff5a9659f3bdce2d7.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/96632e73a6502eb3c4b63292eb03602b87bc5eb64fca4c0ff5a9659f3bdce2d7.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3656316520268186299" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f9f60af32b15f107483d73c3d85d366ed15c32a6ec1c9212409a445be726e8f7.zip" -> "builds/96632e73a6502eb3c4b63292eb03602b87bc5eb64fca4c0ff5a9659f3bdce2d7.zip"
          ~ "timestamp" = "1750304485086757000" -> "1752665333875352000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/672ae45c60f0461434bc17038314858de743dca5f8d958239db8ac1f979f96eb.zip" -> "builds/f2e467fb0cbbd96a2e1f4c8d436a9bca9a24307804352cf113caf9a3ce780ac3.zip"
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ last_modified                  = "2025-06-19T04:04:44.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/deidentifyFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f2e467fb0cbbd96a2e1f4c8d436a9bca9a24307804352cf113caf9a3ce780ac3.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f2e467fb0cbbd96a2e1f4c8d436a9bca9a24307804352cf113caf9a3ce780ac3.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2131316364138734361" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/672ae45c60f0461434bc17038314858de743dca5f8d958239db8ac1f979f96eb.zip" -> "builds/f2e467fb0cbbd96a2e1f4c8d436a9bca9a24307804352cf113caf9a3ce780ac3.zip"
          ~ "timestamp" = "1750304486176021000" -> "1752665333220776000"
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (53 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7918228390821234958" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304486356110000" -> "1752665334677498200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "sbeacon-backend-generateReports:sbeacon-backend-generateReports-0" -> null
      - name        = "sbeacon-backend-generateReports-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/svep-references"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "sbeacon-backend-generateReports" -> null
        # (1 unchanged attribute hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/244a7c3a9a65c489b094bbcee4d6cd298f6d7e11ec28b1119c3e833b610d81fa.zip" -> "builds/f77a8cee37f524067cedb2a17f60f52120ae9b203438a62f52bf05cb07286422.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-06-19T04:05:02.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f77a8cee37f524067cedb2a17f60f52120ae9b203438a62f52bf05cb07286422.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f77a8cee37f524067cedb2a17f60f52120ae9b203438a62f52bf05cb07286422.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4770513196702263191" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/244a7c3a9a65c489b094bbcee4d6cd298f6d7e11ec28b1119c3e833b610d81fa.zip" -> "builds/f77a8cee37f524067cedb2a17f60f52120ae9b203438a62f52bf05cb07286422.zip"
          ~ "timestamp" = "1750304485877991000" -> "1752665333260234200"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/6883ef0c81f3fc25daf7ee60e20bb18e5c8222bda12f4945625fb28c52a3c175.zip" -> "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
        id                             = "sbeacon-backend-getAnalyses"
      ~ last_modified                  = "2025-06-19T04:06:28.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getAnalyses",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5269633995444102661" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6883ef0c81f3fc25daf7ee60e20bb18e5c8222bda12f4945625fb28c52a3c175.zip" -> "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          ~ "timestamp" = "1750304485937924000" -> "1752665333555682000"
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/c10b05ac79a1543791452349cd94dc0becdd627b0c882c67a4f1c485c502d92c.zip" -> "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
        id                             = "sbeacon-backend-getBiosamples"
      ~ last_modified                  = "2025-06-19T04:06:33.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getBiosamples",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6754102612046773008" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c10b05ac79a1543791452349cd94dc0becdd627b0c882c67a4f1c485c502d92c.zip" -> "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          ~ "timestamp" = "1750304486480702000" -> "1752665334028534800"
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (50 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5727102814889996073" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485261010000" -> "1752665333728786000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/68d22259dfad4a666e01fa96d58ae5dce6be2b8646d1c73cc6266f3e781248cf.zip" -> "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-06-19T04:06:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "188314845463011804" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/68d22259dfad4a666e01fa96d58ae5dce6be2b8646d1c73cc6266f3e781248cf.zip" -> "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip"
          ~ "timestamp" = "1750304485945422800" -> "1752665333921935000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (50 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1944775830314614346" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304484752168800" -> "1752665334631390000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (50 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1535092031314829365" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304484926303000" -> "1752665333356092000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/af1e9476675e2f05b14313d9c0ec2ae976b4a6f946f3330ade3e856ba8c0c75b.zip" -> "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ last_modified                  = "2025-06-19T04:06:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getGenomicVariants",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1166768759456982865" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/af1e9476675e2f05b14313d9c0ec2ae976b4a6f946f3330ade3e856ba8c0c75b.zip" -> "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          ~ "timestamp" = "1750304486374982200" -> "1752665334042658000"
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/8c371ff12e5136df162e9fa7bcb5926be18d4b1fce0bfba3ac4489ef1eef43cf.zip" -> "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
        id                             = "sbeacon-backend-getIndividuals"
      ~ last_modified                  = "2025-06-19T04:06:11.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getIndividuals",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2652339302072632159" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8c371ff12e5136df162e9fa7bcb5926be18d4b1fce0bfba3ac4489ef1eef43cf.zip" -> "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          ~ "timestamp" = "1750304485819295000" -> "1752665333829691800"
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (50 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1344241144019637000" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485728579000" -> "1752665333743038000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (50 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8289207545634207845" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485037127000" -> "1752665332920239000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1371344883919656030" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485663984000" -> "1752665333088140000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/878658a187063e4dfad870e9be4e49fd58ec8f23eb5632950dba4c4c8d05184c.zip" -> "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
        id                             = "sbeacon-backend-getRuns"
      ~ last_modified                  = "2025-06-19T04:06:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
   
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.